In [ ]:
Exercises II
Copy the users and roles DataFrames from the examples above.

In [2]:
import numpy as np
import pandas as pd

In [3]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [4]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [5]:
users.describe()

             id   role_id
count  6.000000  4.000000
mean   3.500000  2.250000
std    1.870829  0.957427
min    1.000000  1.000000
25%    2.250000  1.750000
50%    3.500000  2.500000
75%    4.750000  3.000000
max    6.000000  3.000000

In [6]:
users.info

<bound method DataFrame.info of    id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN>

In [7]:
roles.describe()

             id
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [8]:
roles.info

<bound method DataFrame.info of    id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter>

In [ ]:
#2 What is the result of using a right join on the DataFrames?

In [ ]:
#3 What is the result of using an outer join on the DataFrames?

In [ ]:
#4 What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
#5 Load the mpg dataset from PyDataset.

In [ ]:
#6 Output and read the documentation for the mpg dataset.

In [ ]:
#7 How many rows and columns are in the dataset?

In [ ]:
#8 Check out your column names and perform any cleanup you may want on them.

In [ ]:
#9 Display the summary statistics for the dataset.

In [ ]:
#10 How many different manufacturers are there?

In [ ]:
#11 How many different models are there?

In [ ]:
#12 Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [ ]:
#13 Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [ ]:
#14 Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [ ]:
#15 Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [ ]:
#16 Do automatic or manual cars have better miles per gallon?